podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK22F12810.h
/**
 * @file      pin_mapping.h (derived from pin_mapping-MK22F12810.h)
 * @version   1.2.0
 * @brief     Pin declarations for MK22F12810, generated from MK22F12810.csv
 *            Devices   [MK22FN128M10]
 *            Reference [K22P121M100SF9RM]
 */

#ifndef PROJECT_HEADERS_PIN_MAPPING_H_
#define PROJECT_HEADERS_PIN_MAPPING_H_

#include <stddef.h>
#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

//================================
// Validators
// <validate=net.sourceforge.usbdm.annotationEditor.validators.PinMappingValidator>

// <h> Clock settings for FTM0

// FTM0_SC.CLKS ================================
//
//   <o> FTM0_SC.CLKS Clock source
//   <i> Selects the clock source for the FTM0 module. [FTM0_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM0_SC.PS ================================
//
//   <o1> FTM0_SC.PS Clock prescaler
//   <i> Selects the prescaler for the FTM0 module. [FTM0_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
namespace USBDM {

constexpr uint16_t FTM0_SC              = (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0));

} // End namespace

// </h>

// <h> Clock settings for FTM1

// FTM1_SC.CLKS ================================
//
//   <o> FTM1_SC.CLKS Clock source
//   <i> Selects the clock source for the FTM1 module. [FTM1_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM1_SC.PS ================================
//
//   <o1> FTM1_SC.PS Clock prescaler
//   <i> Selects the prescaler for the FTM1 module. [FTM1_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
namespace USBDM {

constexpr uint16_t FTM1_SC              = (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0));

} // End namespace

// </h>

// <h> Clock settings for FTM2

// FTM2_SC.CLKS ================================
//
//   <o> FTM2_SC.CLKS Clock source
//   <i> Selects the clock source for the FTM2 module. [FTM2_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM2_SC.PS ================================
//
//   <o1> FTM2_SC.PS Clock prescaler
//   <i> Selects the prescaler for the FTM2 module. [FTM2_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
namespace USBDM {

constexpr uint16_t FTM2_SC              = (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0));

} // End namespace

// </h>

// Pin mapping Options
//
//   <q> Map pins 
//   <i> Selects whether pin mappings are done when individual
//   <i> peripherals are configured or during reset initialisation.
//     <0=> Pins mapped on demand
//     <1=> Pin mapping on reset
#define DO_MAP_PINS_ON_RESET 0

// Pin peripheral signal mapping
//   <e> Mapping by Pin <name=MAP_BY_PIN>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by individual pin
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_PIN_ENABLED   1

// <h> Miscellaneous Pins

// Signal mapping for ADC0_DM0 pin
//   <o> ADC0_DM0 [ADC0_DM0/ADC1_DM3]<name=ADC0_DM0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC0_DM0 pin
//     <-2=> ADC0_DM0/ADC1_DM3 (reset default)<selection=ADC0_DM0_PIN_SEL,ADC0_DM0 (reset default)><selection=ADC1_DM3_PIN_SEL,ADC0_DM0 (reset default)>
//     <0=> ADC0_DM0/ADC1_DM3<selection=ADC0_DM0_PIN_SEL,ADC0_DM0><selection=ADC1_DM3_PIN_SEL,ADC0_DM0>
//     <-2=> Default
#define ADC0_DM0_SIG_SEL     -2

// Signal mapping for ADC0_DM1 pin
//   <o> ADC0_DM1 [ADC0_DM1]<name=ADC0_DM1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC0_DM1 pin
//     <-2=> ADC0_DM1 (reset default)<selection=ADC0_DM1_PIN_SEL,ADC0_DM1 (reset default)>
//     <0=> ADC0_DM1<selection=ADC0_DM1_PIN_SEL,ADC0_DM1>
//     <-2=> Default
#define ADC0_DM1_SIG_SEL     -2

// Signal mapping for ADC0_DP0 pin
//   <o> ADC0_DP0 [ADC0_DP0/ADC1_DP3]<name=ADC0_DP0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC0_DP0 pin
//     <-2=> ADC0_DP0/ADC1_DP3 (reset default)<selection=ADC0_DP0_PIN_SEL,ADC0_DP0 (reset default)><selection=ADC1_DP3_PIN_SEL,ADC0_DP0 (reset default)>
//     <0=> ADC0_DP0/ADC1_DP3<selection=ADC0_DP0_PIN_SEL,ADC0_DP0><selection=ADC1_DP3_PIN_SEL,ADC0_DP0>
//     <-2=> Default
#define ADC0_DP0_SIG_SEL     -2

// Signal mapping for ADC0_DP1 pin
//   <o> ADC0_DP1 [ADC0_DP1]<name=ADC0_DP1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC0_DP1 pin
//     <-2=> ADC0_DP1 (reset default)<selection=ADC0_DP1_PIN_SEL,ADC0_DP1 (reset default)>
//     <0=> ADC0_DP1<selection=ADC0_DP1_PIN_SEL,ADC0_DP1>
//     <-2=> Default
#define ADC0_DP1_SIG_SEL     -2

// Signal mapping for ADC1_DM0 pin
//   <o> ADC1_DM0 [ADC1_DM0/ADC0_DM3]<name=ADC1_DM0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC1_DM0 pin
//     <-2=> ADC1_DM0/ADC0_DM3 (reset default)<selection=ADC1_DM0_PIN_SEL,ADC1_DM0 (reset default)><selection=ADC0_DM3_PIN_SEL,ADC1_DM0 (reset default)>
//     <0=> ADC1_DM0/ADC0_DM3<selection=ADC1_DM0_PIN_SEL,ADC1_DM0><selection=ADC0_DM3_PIN_SEL,ADC1_DM0>
//     <-2=> Default
#define ADC1_DM0_SIG_SEL     -2

// Signal mapping for ADC1_DM1 pin
//   <o> ADC1_DM1 [ADC1_DM1/ADC0_DM2]<name=ADC1_DM1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC1_DM1 pin
//     <-2=> ADC1_DM1/ADC0_DM2 (reset default)<selection=ADC1_DM1_PIN_SEL,ADC1_DM1 (reset default)><selection=ADC0_DM2_PIN_SEL,ADC1_DM1 (reset default)>
//     <0=> ADC1_DM1/ADC0_DM2<selection=ADC1_DM1_PIN_SEL,ADC1_DM1><selection=ADC0_DM2_PIN_SEL,ADC1_DM1>
//     <-2=> Default
#define ADC1_DM1_SIG_SEL     -2

// Signal mapping for ADC1_DP0 pin
//   <o> ADC1_DP0 [ADC1_DP0/ADC0_DP3]<name=ADC1_DP0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC1_DP0 pin
//     <-2=> ADC1_DP0/ADC0_DP3 (reset default)<selection=ADC1_DP0_PIN_SEL,ADC1_DP0 (reset default)><selection=ADC0_DP3_PIN_SEL,ADC1_DP0 (reset default)>
//     <0=> ADC1_DP0/ADC0_DP3<selection=ADC1_DP0_PIN_SEL,ADC1_DP0><selection=ADC0_DP3_PIN_SEL,ADC1_DP0>
//     <-2=> Default
#define ADC1_DP0_SIG_SEL     -2

// Signal mapping for ADC1_DP1 pin
//   <o> ADC1_DP1 [ADC1_DP1/ADC0_DP2]<name=ADC1_DP1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to ADC1_DP1 pin
//     <-2=> ADC1_DP1/ADC0_DP2 (reset default)<selection=ADC1_DP1_PIN_SEL,ADC1_DP1 (reset default)><selection=ADC0_DP2_PIN_SEL,ADC1_DP1 (reset default)>
//     <0=> ADC1_DP1/ADC0_DP2<selection=ADC1_DP1_PIN_SEL,ADC1_DP1><selection=ADC0_DP2_PIN_SEL,ADC1_DP1>
//     <-2=> Default
#define ADC1_DP1_SIG_SEL     -2

// Signal mapping for CMP0_IN4 pin
//   <o> CMP0_IN4 [CMP0_IN4/ADC1_SE23]<name=CMP0_IN4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to CMP0_IN4 pin
//     <-2=> CMP0_IN4/ADC1_SE23 (reset default)<selection=CMP0_IN4_PIN_SEL,CMP0_IN4 (reset default)><selection=ADC1_SE23_PIN_SEL,CMP0_IN4 (reset default)>
//     <0=> CMP0_IN4/ADC1_SE23<selection=CMP0_IN4_PIN_SEL,CMP0_IN4><selection=ADC1_SE23_PIN_SEL,CMP0_IN4>
//     <-2=> Default
#define CMP0_IN4_SIG_SEL     -2

// Signal mapping for DAC0_OUT pin
//   <o> DAC0_OUT [DAC0_OUT/CMP1_IN3/ADC0_SE23]<name=DAC0_OUT_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to DAC0_OUT pin
//     <-2=> DAC0_OUT/CMP1_IN3/ADC0_SE23 (reset default)<selection=DAC0_OUT_PIN_SEL,DAC0_OUT (reset default)><selection=CMP1_IN3_PIN_SEL,DAC0_OUT (reset default)><selection=ADC0_SE23_PIN_SEL,DAC0_OUT (reset default)>
//     <0=> DAC0_OUT/CMP1_IN3/ADC0_SE23<selection=DAC0_OUT_PIN_SEL,DAC0_OUT><selection=CMP1_IN3_PIN_SEL,DAC0_OUT><selection=ADC0_SE23_PIN_SEL,DAC0_OUT>
//     <-2=> Default
#define DAC0_OUT_SIG_SEL     -2

// Signal mapping for EXTAL32 pin
//   <o> EXTAL32 [EXTAL32]<name=EXTAL32_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to EXTAL32 pin
//     <-2=> EXTAL32 (reset default)<selection=EXTAL32_PIN_SEL,EXTAL32 (reset default)>
//     <0=> EXTAL32<selection=EXTAL32_PIN_SEL,EXTAL32>
//     <-2=> Default
#define EXTAL32_SIG_SEL      -2

// Signal mapping for RESET_b pin
//   <o> RESET_b [RESET_b]<name=RESET_b_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to RESET_b pin
//     <-2=> RESET_b (reset default)<selection=RESET_b_PIN_SEL,RESET_b (reset default)>
//     <0=> RESET_b<selection=RESET_b_PIN_SEL,RESET_b>
//     <-2=> Default
#define RESET_b_SIG_SEL      -2

// Signal mapping for VREF_OUT pin
//   <o> VREF_OUT [VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18]<name=VREF_OUT_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to VREF_OUT pin
//     <-2=> VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18 (reset default)<selection=VREF_OUT_PIN_SEL,VREF_OUT (reset default)><selection=CMP1_IN5_PIN_SEL,VREF_OUT (reset default)><selection=CMP0_IN5_PIN_SEL,VREF_OUT (reset default)><selection=ADC1_SE18_PIN_SEL,VREF_OUT (reset default)>
//     <0=> VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18<selection=VREF_OUT_PIN_SEL,VREF_OUT><selection=CMP1_IN5_PIN_SEL,VREF_OUT><selection=CMP0_IN5_PIN_SEL,VREF_OUT><selection=ADC1_SE18_PIN_SEL,VREF_OUT>
//     <-2=> Default
#define VREF_OUT_SIG_SEL     -2

// Signal mapping for XTAL32 pin
//   <o> XTAL32 [XTAL32]<name=XTAL32_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to XTAL32 pin
//     <-2=> XTAL32 (reset default)<selection=XTAL32_PIN_SEL,XTAL32 (reset default)>
//     <0=> XTAL32<selection=XTAL32_PIN_SEL,XTAL32>
//     <-2=> Default
#define XTAL32_SIG_SEL       -2

