podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK22F12810.h
// </h>

// </e>

// Pin peripheral signal mapping
//   <e> Mapping by Peripheral Function <name=MAP_BY_FUNCTION><constant>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by peripheral function.
//   <i> This option is active when Mapping by Pin is disabled
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_FUNCTION_ENABLED 0

// <h> Miscellaneous

// Pin Mapping for EZP_CS_b signal
//   <o> EZP_CS_b<name=EZP_CS_b_PIN_SEL>
//   <i> Shows which pin EZP_CS_b is mapped to
//     <0=> Disabled
//     <1=> PTA4 (reset default)<selection=PTA4_SIG_SEL,NMI_b/EZP_CS_b (reset default)>
//     <1=> Default
#define EZP_CS_b_PIN_SEL     1

// Pin Mapping for EZP_DI signal
//   <o> EZP_DI<name=EZP_DI_PIN_SEL>
//   <i> Shows which pin EZP_DI is mapped to
//     <0=> Disabled
//     <1=> PTA1 (reset default)<selection=PTA1_SIG_SEL,JTAG_TDI/EZP_DI (reset default)>
//     <1=> Default
#define EZP_DI_PIN_SEL       1

// Pin Mapping for EZP_DO signal
//   <o> EZP_DO<name=EZP_DO_PIN_SEL>
//   <i> Shows which pin EZP_DO is mapped to
//     <0=> Disabled
//     <1=> PTA2 (reset default)<selection=PTA2_SIG_SEL,JTAG_TDO/TRACE_SWO/EZP_DO (reset default)>
//     <1=> Default
#define EZP_DO_PIN_SEL       1

// </h>

// <h> Analogue to Digital (ADC0)

// Pin Mapping for ADC0_DM0 signal
//   <o> ADC0_DM0 [ADC0_DM0]<name=ADC0_DM0_PIN_SEL>
//   <i> Shows which pin ADC0_DM0 is mapped to
//     <0=> Disabled
//     <1=> ADC0_DM0 (reset default)<selection=ADC0_DM0_SIG_SEL,ADC0_DM0/ADC1_DM3 (reset default)>
//     <2=> ADC0_DM0<selection=ADC0_DM0_SIG_SEL,ADC0_DM0/ADC1_DM3>
//     <1=> Default
#define ADC0_DM0_PIN_SEL     1
#if (ADC0_DM0_PIN_SEL == 2)
#define ADC0_DM0_GPIO        USBDM::Gpionull<null>
#define ADC0_DM0_FN          0
#endif

// Pin Mapping for ADC0_DM1 signal
//   <o> ADC0_DM1 [ADC0_DM1]<name=ADC0_DM1_PIN_SEL>
//   <i> Shows which pin ADC0_DM1 is mapped to
//     <0=> Disabled
//     <1=> ADC0_DM1 (reset default)<selection=ADC0_DM1_SIG_SEL,ADC0_DM1 (reset default)>
//     <2=> ADC0_DM1<selection=ADC0_DM1_SIG_SEL,ADC0_DM1>
//     <1=> Default
#define ADC0_DM1_PIN_SEL     1
#if (ADC0_DM1_PIN_SEL == 2)
#define ADC0_DM1_GPIO        USBDM::Gpionull<null>
#define ADC0_DM1_FN          0
#endif

// Pin Mapping for ADC0_DM2 signal
//   <o> ADC0_DM2 [ADC1_DM1]<name=ADC0_DM2_PIN_SEL>
//   <i> Shows which pin ADC0_DM2 is mapped to
//     <0=> Disabled
//     <1=> ADC1_DM1 (reset default)<selection=ADC1_DM1_SIG_SEL,ADC1_DM1/ADC0_DM2 (reset default)>
//     <2=> ADC1_DM1<selection=ADC1_DM1_SIG_SEL,ADC1_DM1/ADC0_DM2>
//     <1=> Default
#define ADC0_DM2_PIN_SEL     1
#if (ADC0_DM2_PIN_SEL == 2)
#define ADC0_DM2_GPIO        USBDM::Gpionull<null>
#define ADC0_DM2_FN          0
#endif

// Pin Mapping for ADC0_DM3 signal
//   <o> ADC0_DM3 [ADC1_DM0]<name=ADC0_DM3_PIN_SEL>
//   <i> Shows which pin ADC0_DM3 is mapped to
//     <0=> Disabled
//     <1=> ADC1_DM0 (reset default)<selection=ADC1_DM0_SIG_SEL,ADC1_DM0/ADC0_DM3 (reset default)>
//     <2=> ADC1_DM0<selection=ADC1_DM0_SIG_SEL,ADC1_DM0/ADC0_DM3>
//     <1=> Default
#define ADC0_DM3_PIN_SEL     1
#if (ADC0_DM3_PIN_SEL == 2)
#define ADC0_DM3_GPIO        USBDM::Gpionull<null>
#define ADC0_DM3_FN          0
#endif

// Pin Mapping for ADC0_DP0 signal
//   <o> ADC0_DP0 [ADC0_DP0]<name=ADC0_DP0_PIN_SEL>
//   <i> Shows which pin ADC0_DP0 is mapped to
//     <0=> Disabled
//     <1=> ADC0_DP0 (reset default)<selection=ADC0_DP0_SIG_SEL,ADC0_DP0/ADC1_DP3 (reset default)>
//     <2=> ADC0_DP0<selection=ADC0_DP0_SIG_SEL,ADC0_DP0/ADC1_DP3>
//     <1=> Default
#define ADC0_DP0_PIN_SEL     1
#if (ADC0_DP0_PIN_SEL == 2)
#define ADC0_DP0_GPIO        USBDM::Gpionull<null>
#define ADC0_DP0_FN          0
#endif

// Pin Mapping for ADC0_DP1 signal
//   <o> ADC0_DP1 [ADC0_DP1]<name=ADC0_DP1_PIN_SEL>
//   <i> Shows which pin ADC0_DP1 is mapped to
//     <0=> Disabled
//     <1=> ADC0_DP1 (reset default)<selection=ADC0_DP1_SIG_SEL,ADC0_DP1 (reset default)>
//     <2=> ADC0_DP1<selection=ADC0_DP1_SIG_SEL,ADC0_DP1>
//     <1=> Default
#define ADC0_DP1_PIN_SEL     1
#if (ADC0_DP1_PIN_SEL == 2)
#define ADC0_DP1_GPIO        USBDM::Gpionull<null>
#define ADC0_DP1_FN          0
#endif

// Pin Mapping for ADC0_DP2 signal
//   <o> ADC0_DP2 [ADC1_DP1]<name=ADC0_DP2_PIN_SEL>
//   <i> Shows which pin ADC0_DP2 is mapped to
//     <0=> Disabled
//     <1=> ADC1_DP1 (reset default)<selection=ADC1_DP1_SIG_SEL,ADC1_DP1/ADC0_DP2 (reset default)>
//     <2=> ADC1_DP1<selection=ADC1_DP1_SIG_SEL,ADC1_DP1/ADC0_DP2>
//     <1=> Default
#define ADC0_DP2_PIN_SEL     1
#if (ADC0_DP2_PIN_SEL == 2)
#define ADC0_DP2_GPIO        USBDM::Gpionull<null>
#define ADC0_DP2_FN          0
#endif

// Pin Mapping for ADC0_DP3 signal
//   <o> ADC0_DP3 [ADC1_DP0]<name=ADC0_DP3_PIN_SEL>
//   <i> Shows which pin ADC0_DP3 is mapped to
//     <0=> Disabled
//     <1=> ADC1_DP0 (reset default)<selection=ADC1_DP0_SIG_SEL,ADC1_DP0/ADC0_DP3 (reset default)>
//     <2=> ADC1_DP0<selection=ADC1_DP0_SIG_SEL,ADC1_DP0/ADC0_DP3>
//     <1=> Default
#define ADC0_DP3_PIN_SEL     1
#if (ADC0_DP3_PIN_SEL == 2)
#define ADC0_DP3_GPIO        USBDM::Gpionull<null>
#define ADC0_DP3_FN          0
#endif

// Pin Mapping for ADC0_SE4b signal
//   <o> ADC0_SE4b [PTC2]<name=ADC0_SE4b_PIN_SEL>
//   <i> Shows which pin ADC0_SE4b is mapped to
//     <0=> Disabled
//     <1=> PTC2 (reset default)<selection=PTC2_SIG_SEL,ADC0_SE4b/CMP1_IN0 (reset default)>
//     <2=> PTC2<selection=PTC2_SIG_SEL,ADC0_SE4b/CMP1_IN0>
//     <1=> Default
#define ADC0_SE4b_PIN_SEL    1

// Pin Mapping for ADC0_SE5b signal
//   <o> ADC0_SE5b [PTD1]<name=ADC0_SE5b_PIN_SEL>
//   <i> Shows which pin ADC0_SE5b is mapped to
//     <0=> Disabled
//     <1=> PTD1 (reset default)<selection=PTD1_SIG_SEL,ADC0_SE5b (reset default)>
//     <2=> PTD1<selection=PTD1_SIG_SEL,ADC0_SE5b>
//     <1=> Default
#define ADC0_SE5b_PIN_SEL    1

// Pin Mapping for ADC0_SE6b signal
//   <o> ADC0_SE6b [PTD5]<name=ADC0_SE6b_PIN_SEL>
//   <i> Shows which pin ADC0_SE6b is mapped to
//     <0=> Disabled
//     <1=> PTD5 (reset default)<selection=PTD5_SIG_SEL,ADC0_SE6b (reset default)>
//     <2=> PTD5<selection=PTD5_SIG_SEL,ADC0_SE6b>
//     <1=> Default
#define ADC0_SE6b_PIN_SEL    1

// Pin Mapping for ADC0_SE7b signal
//   <o> ADC0_SE7b [PTD6]<name=ADC0_SE7b_PIN_SEL>
//   <i> Shows which pin ADC0_SE7b is mapped to
//     <0=> Disabled
//     <1=> PTD6 (reset default)<selection=PTD6_SIG_SEL,ADC0_SE7b (reset default)>
//     <2=> PTD6<selection=PTD6_SIG_SEL,ADC0_SE7b>
//     <1=> Default
#define ADC0_SE7b_PIN_SEL    1

// Pin Mapping for ADC0_SE8 signal
//   <o> ADC0_SE8 [PTB0]<name=ADC0_SE8_PIN_SEL>
//   <i> Shows which pin ADC0_SE8 is mapped to
//     <0=> Disabled
//     <1=> PTB0 (reset default)<selection=PTB0_SIG_SEL,ADC0_SE8/ADC1_SE8 (reset default)>
//     <2=> PTB0<selection=PTB0_SIG_SEL,ADC0_SE8/ADC1_SE8>
//     <1=> Default
#define ADC0_SE8_PIN_SEL     1

// Pin Mapping for ADC0_SE9 signal
//   <o> ADC0_SE9 [PTB1]<name=ADC0_SE9_PIN_SEL>
//   <i> Shows which pin ADC0_SE9 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,ADC0_SE9/ADC1_SE9 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,ADC0_SE9/ADC1_SE9>
//     <1=> Default
#define ADC0_SE9_PIN_SEL     1

// Pin Mapping for ADC0_SE12 signal
//   <o> ADC0_SE12 [PTB2]<name=ADC0_SE12_PIN_SEL>
//   <i> Shows which pin ADC0_SE12 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (reset default)<selection=PTB2_SIG_SEL,ADC0_SE12 (reset default)>
//     <2=> PTB2<selection=PTB2_SIG_SEL,ADC0_SE12>
//     <1=> Default
#define ADC0_SE12_PIN_SEL    1

// Pin Mapping for ADC0_SE13 signal
//   <o> ADC0_SE13 [PTB3]<name=ADC0_SE13_PIN_SEL>
//   <i> Shows which pin ADC0_SE13 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (reset default)<selection=PTB3_SIG_SEL,ADC0_SE13 (reset default)>
//     <2=> PTB3<selection=PTB3_SIG_SEL,ADC0_SE13>
//     <1=> Default
#define ADC0_SE13_PIN_SEL    1

