podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK22F12810.h
// Pin Mapping for ADC1_SE9 signal
//   <o> ADC1_SE9 [PTB1]<name=ADC1_SE9_PIN_SEL>
//   <i> Shows which pin ADC1_SE9 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,ADC0_SE9/ADC1_SE9 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,ADC0_SE9/ADC1_SE9>
//     <1=> Default
#define ADC1_SE9_PIN_SEL     1

// Pin Mapping for ADC1_SE14 signal
//   <o> ADC1_SE14 [PTB10]<name=ADC1_SE14_PIN_SEL>
//   <i> Shows which pin ADC1_SE14 is mapped to
//     <0=> Disabled
//     <1=> PTB10 (reset default)<selection=PTB10_SIG_SEL,ADC1_SE14 (reset default)>
//     <2=> PTB10<selection=PTB10_SIG_SEL,ADC1_SE14>
//     <1=> Default
#define ADC1_SE14_PIN_SEL    1

// Pin Mapping for ADC1_SE15 signal
//   <o> ADC1_SE15 [PTB11]<name=ADC1_SE15_PIN_SEL>
//   <i> Shows which pin ADC1_SE15 is mapped to
//     <0=> Disabled
//     <1=> PTB11 (reset default)<selection=PTB11_SIG_SEL,ADC1_SE15 (reset default)>
//     <2=> PTB11<selection=PTB11_SIG_SEL,ADC1_SE15>
//     <1=> Default
#define ADC1_SE15_PIN_SEL    1

// Pin Mapping for ADC1_SE17 signal
//   <o> ADC1_SE17 [PTA17]<name=ADC1_SE17_PIN_SEL>
//   <i> Shows which pin ADC1_SE17 is mapped to
//     <0=> Disabled
//     <1=> PTA17 (reset default)<selection=PTA17_SIG_SEL,ADC1_SE17 (reset default)>
//     <2=> PTA17<selection=PTA17_SIG_SEL,ADC1_SE17>
//     <1=> Default
#define ADC1_SE17_PIN_SEL    1

// Pin Mapping for ADC1_SE18 signal
//   <o> ADC1_SE18 [VREF_OUT]<name=ADC1_SE18_PIN_SEL>
//   <i> Shows which pin ADC1_SE18 is mapped to
//     <0=> Disabled
//     <1=> VREF_OUT (reset default)<selection=VREF_OUT_SIG_SEL,VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18 (reset default)>
//     <2=> VREF_OUT<selection=VREF_OUT_SIG_SEL,VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18>
//     <1=> Default
#define ADC1_SE18_PIN_SEL    1

// Pin Mapping for ADC1_SE23 signal
//   <o> ADC1_SE23 [CMP0_IN4]<name=ADC1_SE23_PIN_SEL>
//   <i> Shows which pin ADC1_SE23 is mapped to
//     <0=> Disabled
//     <1=> CMP0_IN4 (reset default)<selection=CMP0_IN4_SIG_SEL,CMP0_IN4/ADC1_SE23 (reset default)>
//     <2=> CMP0_IN4<selection=CMP0_IN4_SIG_SEL,CMP0_IN4/ADC1_SE23>
//     <1=> Default
#define ADC1_SE23_PIN_SEL    1

// </h>

// <h> Clock and Timing

// Pin Mapping for CLKOUT signal
//   <o> CLKOUT [PTC3]<name=CLKOUT_PIN_SEL>
//   <i> Shows which pin CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,CLKOUT>
//     <0=> Default
#define CLKOUT_PIN_SEL       0
#if (CLKOUT_PIN_SEL == 1)
#define CLKOUT_GPIO          USBDM::GpioC<3>
#define CLKOUT_FN            5
#endif

// Pin Mapping for CLKOUT32K signal
//   <o> CLKOUT32K [PTE0, PTE26]<name=CLKOUT32K_PIN_SEL>
//   <i> Shows which pin CLKOUT32K is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,GPIOE_0/CLKOUT32K>
//     <2=> PTE26<selection=PTE26_SIG_SEL,GPIOE_26/CLKOUT32K>
//     <0=> Default
#define CLKOUT32K_PIN_SEL    0
#if (CLKOUT32K_PIN_SEL == 1)
#define CLKOUT32K_GPIO       USBDM::GpioE<0>
#define CLKOUT32K_FN         1
#elif (CLKOUT32K_PIN_SEL == 2)
#define CLKOUT32K_GPIO       USBDM::GpioE<26>
#define CLKOUT32K_FN         1
#endif

// Pin Mapping for EXTAL0 signal
//   <o> EXTAL0 [PTA18]<name=EXTAL0_PIN_SEL>
//   <i> Shows which pin EXTAL0 is mapped to
//     <0=> Disabled
//     <1=> PTA18 (reset default)<selection=PTA18_SIG_SEL,EXTAL0 (reset default)>
//     <2=> PTA18<selection=PTA18_SIG_SEL,EXTAL0>
//     <1=> Default
#define EXTAL0_PIN_SEL       1
#if (EXTAL0_PIN_SEL == 2)
#define EXTAL0_GPIO          USBDM::GpioA<18>
#define EXTAL0_FN            0
#endif

// Pin Mapping for EXTAL32 signal
//   <o> EXTAL32 [EXTAL32]<name=EXTAL32_PIN_SEL>
//   <i> Shows which pin EXTAL32 is mapped to
//     <0=> Disabled
//     <1=> EXTAL32 (reset default)<selection=EXTAL32_SIG_SEL,EXTAL32 (reset default)>
//     <2=> EXTAL32<selection=EXTAL32_SIG_SEL,EXTAL32>
//     <1=> Default
#define EXTAL32_PIN_SEL      1
#if (EXTAL32_PIN_SEL == 2)
#define EXTAL32_GPIO         USBDM::Gpionull<null>
#define EXTAL32_FN           0
#endif

// Pin Mapping for EZP_CLK signal
//   <o> EZP_CLK<name=EZP_CLK_PIN_SEL>
//   <i> Shows which pin EZP_CLK is mapped to
//     <0=> Disabled
//     <1=> PTA0 (reset default)<selection=PTA0_SIG_SEL,JTAG_TCLK/SWD_CLK/EZP_CLK (reset default)>
//     <1=> Default
#define EZP_CLK_PIN_SEL      1

// Pin Mapping for FTM_CLKIN0 signal
//   <o> FTM_CLKIN0 [PTA18, PTB16]<name=FTM_CLKIN0_PIN_SEL>
//   <i> Shows which pin FTM_CLKIN0 is mapped to
//     <0=> Disabled
//     <1=> PTA18<selection=PTA18_SIG_SEL,FTM_CLKIN0>
//     <2=> PTB16<selection=PTB16_SIG_SEL,FTM_CLKIN0>
//     <0=> Default
#define FTM_CLKIN0_PIN_SEL   0
#if (FTM_CLKIN0_PIN_SEL == 1)
#define FTM_CLKIN0_GPIO      USBDM::GpioA<18>
#define FTM_CLKIN0_FN        4
#elif (FTM_CLKIN0_PIN_SEL == 2)
#define FTM_CLKIN0_GPIO      USBDM::GpioB<16>
#define FTM_CLKIN0_FN        4
#endif

// Pin Mapping for FTM_CLKIN1 signal
//   <o> FTM_CLKIN1 [PTA19, PTB17]<name=FTM_CLKIN1_PIN_SEL>
//   <i> Shows which pin FTM_CLKIN1 is mapped to
//     <0=> Disabled
//     <1=> PTA19<selection=PTA19_SIG_SEL,FTM_CLKIN1>
//     <2=> PTB17<selection=PTB17_SIG_SEL,FTM_CLKIN1>
//     <0=> Default
#define FTM_CLKIN1_PIN_SEL   0
#if (FTM_CLKIN1_PIN_SEL == 1)
#define FTM_CLKIN1_GPIO      USBDM::GpioA<19>
#define FTM_CLKIN1_FN        4
#elif (FTM_CLKIN1_PIN_SEL == 2)
#define FTM_CLKIN1_GPIO      USBDM::GpioB<17>
#define FTM_CLKIN1_FN        4
#endif

// Pin Mapping for RTC_CLKOUT signal
//   <o> RTC_CLKOUT [PTE26, PTE0]<name=RTC_CLKOUT_PIN_SEL>
//   <i> Shows which pin RTC_CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTE26<selection=PTE26_SIG_SEL,RTC_CLKOUT>
//     <2=> PTE0<selection=PTE0_SIG_SEL,RTC_CLKOUT>
//     <0=> Default
#define RTC_CLKOUT_PIN_SEL   0
#if (RTC_CLKOUT_PIN_SEL == 1)
#define RTC_CLKOUT_GPIO      USBDM::GpioE<26>
#define RTC_CLKOUT_FN        6
#elif (RTC_CLKOUT_PIN_SEL == 2)
#define RTC_CLKOUT_GPIO      USBDM::GpioE<0>
#define RTC_CLKOUT_FN        7
#endif

// Pin Mapping for XTAL0 signal
//   <o> XTAL0 [PTA19]<name=XTAL0_PIN_SEL>
//   <i> Shows which pin XTAL0 is mapped to
//     <0=> Disabled
//     <1=> PTA19 (reset default)<selection=PTA19_SIG_SEL,XTAL0 (reset default)>
//     <2=> PTA19<selection=PTA19_SIG_SEL,XTAL0>
//     <1=> Default
#define XTAL0_PIN_SEL        1
#if (XTAL0_PIN_SEL == 2)
#define XTAL0_GPIO           USBDM::GpioA<19>
#define XTAL0_FN             0
#endif

// Pin Mapping for XTAL32 signal
//   <o> XTAL32 [XTAL32]<name=XTAL32_PIN_SEL>
//   <i> Shows which pin XTAL32 is mapped to
//     <0=> Disabled
//     <1=> XTAL32 (reset default)<selection=XTAL32_SIG_SEL,XTAL32 (reset default)>
//     <2=> XTAL32<selection=XTAL32_SIG_SEL,XTAL32>
//     <1=> Default
#define XTAL32_PIN_SEL       1
#if (XTAL32_PIN_SEL == 2)
#define XTAL32_GPIO          USBDM::Gpionull<null>
#define XTAL32_FN            0
#endif

