podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK22F12810.h
// Pin Mapping for LLWU_P5 signal
//   <o> LLWU_P5 [PTB0]<name=LLWU_P5_PIN_SEL>
//   <i> Shows which pin LLWU_P5 is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,GPIOB_0/LLWU_P5>
//     <0=> Default
#define LLWU_P5_PIN_SEL      0
#if (LLWU_P5_PIN_SEL == 1)
#define LLWU_P5_GPIO         USBDM::GpioB<0>
#define LLWU_P5_FN           1
#endif

// Pin Mapping for LLWU_P6 signal
//   <o> LLWU_P6 [PTC1]<name=LLWU_P6_PIN_SEL>
//   <i> Shows which pin LLWU_P6 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,GPIOC_1/LLWU_P6>
//     <0=> Default
#define LLWU_P6_PIN_SEL      0
#if (LLWU_P6_PIN_SEL == 1)
#define LLWU_P6_GPIO         USBDM::GpioC<1>
#define LLWU_P6_FN           1
#endif

// Pin Mapping for LLWU_P7 signal
//   <o> LLWU_P7 [PTC3]<name=LLWU_P7_PIN_SEL>
//   <i> Shows which pin LLWU_P7 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,GPIOC_3/LLWU_P7>
//     <0=> Default
#define LLWU_P7_PIN_SEL      0
#if (LLWU_P7_PIN_SEL == 1)
#define LLWU_P7_GPIO         USBDM::GpioC<3>
#define LLWU_P7_FN           1
#endif

// Pin Mapping for LLWU_P8 signal
//   <o> LLWU_P8 [PTC4]<name=LLWU_P8_PIN_SEL>
//   <i> Shows which pin LLWU_P8 is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,GPIOC_4/LLWU_P8>
//     <0=> Default
#define LLWU_P8_PIN_SEL      0
#if (LLWU_P8_PIN_SEL == 1)
#define LLWU_P8_GPIO         USBDM::GpioC<4>
#define LLWU_P8_FN           1
#endif

// Pin Mapping for LLWU_P9 signal
//   <o> LLWU_P9 [PTC5]<name=LLWU_P9_PIN_SEL>
//   <i> Shows which pin LLWU_P9 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,GPIOC_5/LLWU_P9>
//     <0=> Default
#define LLWU_P9_PIN_SEL      0
#if (LLWU_P9_PIN_SEL == 1)
#define LLWU_P9_GPIO         USBDM::GpioC<5>
#define LLWU_P9_FN           1
#endif

// Pin Mapping for LLWU_P10 signal
//   <o> LLWU_P10 [PTC6]<name=LLWU_P10_PIN_SEL>
//   <i> Shows which pin LLWU_P10 is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,GPIOC_6/LLWU_P10>
//     <0=> Default
#define LLWU_P10_PIN_SEL     0
#if (LLWU_P10_PIN_SEL == 1)
#define LLWU_P10_GPIO        USBDM::GpioC<6>
#define LLWU_P10_FN          1
#endif

// Pin Mapping for LLWU_P11 signal
//   <o> LLWU_P11 [PTC11]<name=LLWU_P11_PIN_SEL>
//   <i> Shows which pin LLWU_P11 is mapped to
//     <0=> Disabled
//     <1=> PTC11<selection=PTC11_SIG_SEL,GPIOC_11/LLWU_P11>
//     <0=> Default
#define LLWU_P11_PIN_SEL     0
#if (LLWU_P11_PIN_SEL == 1)
#define LLWU_P11_GPIO        USBDM::GpioC<11>
#define LLWU_P11_FN          1
#endif

// Pin Mapping for LLWU_P12 signal
//   <o> LLWU_P12 [PTD0]<name=LLWU_P12_PIN_SEL>
//   <i> Shows which pin LLWU_P12 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,GPIOD_0/LLWU_P12>
//     <0=> Default
#define LLWU_P12_PIN_SEL     0
#if (LLWU_P12_PIN_SEL == 1)
#define LLWU_P12_GPIO        USBDM::GpioD<0>
#define LLWU_P12_FN          1
#endif

// Pin Mapping for LLWU_P13 signal
//   <o> LLWU_P13 [PTD2]<name=LLWU_P13_PIN_SEL>
//   <i> Shows which pin LLWU_P13 is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,GPIOD_2/LLWU_P13>
//     <0=> Default
#define LLWU_P13_PIN_SEL     0
#if (LLWU_P13_PIN_SEL == 1)
#define LLWU_P13_GPIO        USBDM::GpioD<2>
#define LLWU_P13_FN          1
#endif

// Pin Mapping for LLWU_P14 signal
//   <o> LLWU_P14 [PTD4]<name=LLWU_P14_PIN_SEL>
//   <i> Shows which pin LLWU_P14 is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,GPIOD_4/LLWU_P14>
//     <0=> Default
#define LLWU_P14_PIN_SEL     0
#if (LLWU_P14_PIN_SEL == 1)
#define LLWU_P14_GPIO        USBDM::GpioD<4>
#define LLWU_P14_FN          1
#endif

// Pin Mapping for LLWU_P15 signal
//   <o> LLWU_P15 [PTD6]<name=LLWU_P15_PIN_SEL>
//   <i> Shows which pin LLWU_P15 is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,GPIOD_6/LLWU_P15>
//     <0=> Default
#define LLWU_P15_PIN_SEL     0
#if (LLWU_P15_PIN_SEL == 1)
#define LLWU_P15_GPIO        USBDM::GpioD<6>
#define LLWU_P15_FN          1
#endif

// </h>

// <h> Low Power Timer (LPTMR)

// Pin Mapping for LPTMR0_ALT1 signal
//   <o> LPTMR0_ALT1 [PTA19]<name=LPTMR0_ALT1_PIN_SEL>
//   <i> Shows which pin LPTMR0_ALT1 is mapped to
//     <0=> Disabled
//     <1=> PTA19<selection=PTA19_SIG_SEL,LPTMR0_ALT1>
//     <0=> Default
#define LPTMR0_ALT1_PIN_SEL  0
#if (LPTMR0_ALT1_PIN_SEL == 1)
#define LPTMR0_ALT1_GPIO     USBDM::GpioA<19>
#define LPTMR0_ALT1_FN       6
#endif

// Pin Mapping for LPTMR0_ALT2 signal
//   <o> LPTMR0_ALT2 [PTC5]<name=LPTMR0_ALT2_PIN_SEL>
//   <i> Shows which pin LPTMR0_ALT2 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,LPTMR0_ALT2>
//     <0=> Default
#define LPTMR0_ALT2_PIN_SEL  0
#if (LPTMR0_ALT2_PIN_SEL == 1)
#define LPTMR0_ALT2_GPIO     USBDM::GpioC<5>
#define LPTMR0_ALT2_FN       3
#endif

// </h>

// <h> Low Power UART (LPUART0)

// Pin Mapping for LPUART0_CTS_b signal
//   <o> LPUART0_CTS_b [PTB9, PTE6, PTD1, PTC2]<name=LPUART0_CTS_b_PIN_SEL>
//   <i> Shows which pin LPUART0_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTB9<selection=PTB9_SIG_SEL,LPUART0_CTS_b>
//     <2=> PTE6<selection=PTE6_SIG_SEL,LPUART0_CTS_b>
//     <3=> PTD1<selection=PTD1_SIG_SEL,LPUART0_CTS_b>
//     <4=> PTC2<selection=PTC2_SIG_SEL,LPUART0_CTS_b>
//     <0=> Default
#define LPUART0_CTS_b_PIN_SEL 0
#if (LPUART0_CTS_b_PIN_SEL == 1)
#define LPUART0_CTS_b_GPIO   USBDM::GpioB<9>
#define LPUART0_CTS_b_FN     3
#elif (LPUART0_CTS_b_PIN_SEL == 2)
#define LPUART0_CTS_b_GPIO   USBDM::GpioE<6>
#define LPUART0_CTS_b_FN     3
#elif (LPUART0_CTS_b_PIN_SEL == 3)
#define LPUART0_CTS_b_GPIO   USBDM::GpioD<1>
#define LPUART0_CTS_b_FN     6
#elif (LPUART0_CTS_b_PIN_SEL == 4)
#define LPUART0_CTS_b_GPIO   USBDM::GpioC<2>
#define LPUART0_CTS_b_FN     7
#endif

// Pin Mapping for LPUART0_RTS_b signal
//   <o> LPUART0_RTS_b [PTB8, PTC18, PTD0, PTC1]<name=LPUART0_RTS_b_PIN_SEL>
//   <i> Shows which pin LPUART0_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTB8<selection=PTB8_SIG_SEL,LPUART0_RTS_b>
//     <2=> PTC18<selection=PTC18_SIG_SEL,LPUART0_RTS_b>
//     <3=> PTD0<selection=PTD0_SIG_SEL,LPUART0_RTS_b>
//     <4=> PTC1<selection=PTC1_SIG_SEL,LPUART0_RTS_b>
//     <0=> Default
#define LPUART0_RTS_b_PIN_SEL 0
#if (LPUART0_RTS_b_PIN_SEL == 1)
#define LPUART0_RTS_b_GPIO   USBDM::GpioB<8>
#define LPUART0_RTS_b_FN     3
#elif (LPUART0_RTS_b_PIN_SEL == 2)
#define LPUART0_RTS_b_GPIO   USBDM::GpioC<18>
#define LPUART0_RTS_b_FN     3
#elif (LPUART0_RTS_b_PIN_SEL == 3)
#define LPUART0_RTS_b_GPIO   USBDM::GpioD<0>
#define LPUART0_RTS_b_FN     6
#elif (LPUART0_RTS_b_PIN_SEL == 4)
#define LPUART0_RTS_b_GPIO   USBDM::GpioC<1>
#define LPUART0_RTS_b_FN     7
#endif

// Pin Mapping for LPUART0_RX signal
//   <o> LPUART0_RX [PTB10, PTC16, PTE5, PTD2, PTC3]<name=LPUART0_RX_PIN_SEL>
//   <i> Shows which pin LPUART0_RX is mapped to
//     <0=> Disabled
//     <1=> PTB10<selection=PTB10_SIG_SEL,LPUART0_RX>
//     <2=> PTC16<selection=PTC16_SIG_SEL,LPUART0_RX>
//     <3=> PTE5<selection=PTE5_SIG_SEL,LPUART0_RX>
//     <4=> PTD2<selection=PTD2_SIG_SEL,LPUART0_RX>
//     <5=> PTC3<selection=PTC3_SIG_SEL,LPUART0_RX>
//     <0=> Default
#define LPUART0_RX_PIN_SEL   0
#if (LPUART0_RX_PIN_SEL == 1)
#define LPUART0_RX_GPIO      USBDM::GpioB<10>
#define LPUART0_RX_FN        3
#elif (LPUART0_RX_PIN_SEL == 2)
#define LPUART0_RX_GPIO      USBDM::GpioC<16>
#define LPUART0_RX_FN        3
#elif (LPUART0_RX_PIN_SEL == 3)
#define LPUART0_RX_GPIO      USBDM::GpioE<5>
#define LPUART0_RX_FN        3
#elif (LPUART0_RX_PIN_SEL == 4)
#define LPUART0_RX_GPIO      USBDM::GpioD<2>
#define LPUART0_RX_FN        6
#elif (LPUART0_RX_PIN_SEL == 5)
#define LPUART0_RX_GPIO      USBDM::GpioC<3>
#define LPUART0_RX_FN        7
#endif

// Pin Mapping for LPUART0_TX signal
//   <o> LPUART0_TX [PTB11, PTC17, PTE4, PTD3, PTC4]<name=LPUART0_TX_PIN_SEL>
//   <i> Shows which pin LPUART0_TX is mapped to
//     <0=> Disabled
//     <1=> PTB11<selection=PTB11_SIG_SEL,LPUART0_TX>
//     <2=> PTC17<selection=PTC17_SIG_SEL,LPUART0_TX>
//     <3=> PTE4<selection=PTE4_SIG_SEL,LPUART0_TX>
//     <4=> PTD3<selection=PTD3_SIG_SEL,LPUART0_TX>
//     <5=> PTC4<selection=PTC4_SIG_SEL,LPUART0_TX>
//     <0=> Default
#define LPUART0_TX_PIN_SEL   0
#if (LPUART0_TX_PIN_SEL == 1)
#define LPUART0_TX_GPIO      USBDM::GpioB<11>
#define LPUART0_TX_FN        3
#elif (LPUART0_TX_PIN_SEL == 2)
#define LPUART0_TX_GPIO      USBDM::GpioC<17>
#define LPUART0_TX_FN        3
#elif (LPUART0_TX_PIN_SEL == 3)
#define LPUART0_TX_GPIO      USBDM::GpioE<4>
#define LPUART0_TX_FN        3
#elif (LPUART0_TX_PIN_SEL == 4)
#define LPUART0_TX_GPIO      USBDM::GpioD<3>
#define LPUART0_TX_FN        6
#elif (LPUART0_TX_PIN_SEL == 5)
#define LPUART0_TX_GPIO      USBDM::GpioC<4>
#define LPUART0_TX_FN        7
#endif

