podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK22F12810.h
#if (PTB18_SIG_SEL == 3)
using ftm2_ch0             = const USBDM::Ftm2<0>;
#endif
#if (PTB19_SIG_SEL == 3)
using ftm2_ch1             = const USBDM::Ftm2<1>;
#endif
/**
 * @}
 */
/**
* @addtogroup SpiIO_Group SPI, Serial Peripheral Interface
* @brief Pins used for SPI functions
* @{
*/
using spi0_PCS0            = const USBDM::PcrTable_T<3, Spi0Info>;
using spi0_SCK             = const USBDM::PcrTable_T<0, Spi0Info>;
using spi0_SOUT            = const USBDM::PcrTable_T<2, Spi0Info>;
using spi0_SIN             = const USBDM::PcrTable_T<1, Spi0Info>;
using spi0_PCS5            = const USBDM::PcrTable_T<8, Spi0Info>;
using spi0_PCS4            = const USBDM::PcrTable_T<7, Spi0Info>;
using spi0_PCS3            = const USBDM::PcrTable_T<6, Spi0Info>;
using spi0_PCS2            = const USBDM::PcrTable_T<5, Spi0Info>;
using spi0_PCS1            = const USBDM::PcrTable_T<4, Spi0Info>;
/**
 * @}
 */
/**
* @addtogroup SpiIO_Group SPI, Serial Peripheral Interface
* @brief Pins used for SPI functions
* @{
*/
using spi1_PCS1            = const USBDM::PcrTable_T<4, Spi1Info>;
using spi1_PCS0            = const USBDM::PcrTable_T<3, Spi1Info>;
using spi1_SCK             = const USBDM::PcrTable_T<0, Spi1Info>;
using spi1_SOUT            = const USBDM::PcrTable_T<2, Spi1Info>;
using spi1_SIN             = const USBDM::PcrTable_T<1, Spi1Info>;
using spi1_PCS2            = const USBDM::PcrTable_T<5, Spi1Info>;
using spi1_PCS3            = const USBDM::PcrTable_T<6, Spi1Info>;
/**
 * @}
 */
/**
* @addtogroup I2CIO_Group I2C, Inter-Integrated-Circuit Interface
* @brief Pins used for I2C functions
* @{
*/
using i2c0_SCLPcr    = const USBDM::PcrTable_T<0, I2c0Info>;
using i2c0_SCLGpio   = const USBDM::GpioTable_T<0, I2c0Info>;
using i2c0_SDAPcr    = const USBDM::PcrTable_T<1, I2c0Info>;
using i2c0_SDAGpio   = const USBDM::GpioTable_T<1, I2c0Info>;
/**
 * @}
 */
/**
* @addtogroup I2CIO_Group I2C, Inter-Integrated-Circuit Interface
* @brief Pins used for I2C functions
* @{
*/
using i2c1_SCLPcr    = const USBDM::PcrTable_T<0, I2c1Info>;
using i2c1_SCLGpio   = const USBDM::GpioTable_T<0, I2c1Info>;
using i2c1_SDAPcr    = const USBDM::PcrTable_T<1, I2c1Info>;
using i2c1_SDAGpio   = const USBDM::GpioTable_T<1, I2c1Info>;
/**
 * @}
 */
/**
* @addtogroup DMA_Group Direct Memory Access (DMA)
* @brief Support for DMA operations
* @{
*/
enum {
DMA0_SLOT_Disabled                   = 0,
DMA0_SLOT_UART0_Receive              = 2,
DMA0_SLOT_UART0_Transmit             = 3,
DMA0_SLOT_UART1_Receive              = 4,
DMA0_SLOT_UART1_Transmit             = 5,
DMA0_SLOT_UART2_Receive              = 6,
DMA0_SLOT_UART2_Transmit             = 7,
DMA0_SLOT_I2S0_Receive               = 12,
DMA0_SLOT_I2S0_Transmit              = 13,
DMA0_SLOT_SPI0_Receive               = 14,
DMA0_SLOT_SPI0_Transmit              = 15,
DMA0_SLOT_SPI1_TransmitReceive       = 16,
DMA0_SLOT_I2C0                       = 18,
DMA0_SLOT_I2C1                       = 19,
DMA0_SLOT_FTM0_Ch_0                  = 20,
DMA0_SLOT_FTM0_Ch_1                  = 21,
DMA0_SLOT_FTM0_Ch_2                  = 22,
DMA0_SLOT_FTM0_Ch_3                  = 23,
DMA0_SLOT_FTM0_Ch_4                  = 24,
DMA0_SLOT_FTM0_Ch_5                  = 25,
DMA0_SLOT_FTM0_Ch_6                  = 26,
DMA0_SLOT_FTM0_Ch_7                  = 27,
DMA0_SLOT_FTM1_Ch_0                  = 28,
DMA0_SLOT_FTM1_Ch_1                  = 29,
DMA0_SLOT_FTM2_Ch_0                  = 30,
DMA0_SLOT_FTM2_Ch_1                  = 31,
DMA0_SLOT_ADC0                       = 40,
DMA0_SLOT_ADC1                       = 41,
DMA0_SLOT_CMP0                       = 42,
DMA0_SLOT_CMP1                       = 43,
DMA0_SLOT_DAC0                       = 45,
DMA0_SLOT_PDB                        = 48,
DMA0_SLOT_PortA                      = 49,
DMA0_SLOT_PortB                      = 50,
DMA0_SLOT_PortC                      = 51,
DMA0_SLOT_PortD                      = 52,
DMA0_SLOT_PortE                      = 53,
DMA0_SLOT_LPUART_Receive             = 58,
DMA0_SLOT_LPUART_Transmit            = 59,
DMA0_SLOT_AlwaysEnabled0             = 60,
DMA0_SLOT_AlwaysEnabled1             = 61,
DMA0_SLOT_AlwaysEnabled2             = 62,
DMA0_SLOT_AlwaysEnabled3             = 63,
};
/**
 * @}
 */
#if (DO_MAP_PINS_ON_RESET>0)
/**
 * Used to configure pin-mapping before 1st use of peripherals
 */
extern void usbdm_PinMapping();
#endif

} // End namespace USBDM

#endif /* PIN_MAPPING_H_ */
